#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-gcp-gke/runs/run-bP3W9Ge7jm8G9kCv

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_id.run_id: Refreshing state... [id=-wXbbQ]
module.gke.google_compute_router.router: Refreshing state... [id=projects/test-terraform-project-01/regions/asia-southeast2/routers/gke-fb05db6d-router]
module.gke.google_compute_router_nat.nat: Refreshing state... [id=test-terraform-project-01/asia-southeast2/gke-fb05db6d-router/gke-fb05db6d-nat]
module.gke.google_service_account.default: Refreshing state... [id=projects/test-terraform-project-01/serviceAccounts/gke-fb05db6d-sa@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-fb05db6d]
module.gke.google_container_node_pool.primary_node_pool: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-fb05db6d/nodePools/primary]
module.gke.google_compute_firewall.gke_private_cluster_istio_gatekeeper_rules: Refreshing state... [id=projects/test-terraform-project-01/global/firewalls/honest-gke-fb05db6d-private-cluster-allow]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.gke.google_compute_firewall.gke_private_cluster_istio_gatekeeper_rules has changed
  ~ resource "google_compute_firewall" "gke_private_cluster_istio_gatekeeper_rules" {
        id                      = "projects/test-terraform-project-01/global/firewalls/honest-gke-fb05db6d-private-cluster-allow"
        name                    = "honest-gke-fb05db6d-private-cluster-allow"
      ~ source_ranges           = [
          + "10.40.0.0/28",
        ]
      ~ source_tags             = [
          - "gke-gke-fb05db6d-node",
        ]
      ~ target_tags             = [
          + "gke-gke-fb05db6d-node",
        ]
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.gke.data.google_container_cluster.current_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "current_cluster"  {
      + addons_config                     = (known after apply)
      + authenticator_groups_config       = (known after apply)
      + cluster_autoscaling               = (known after apply)
      + cluster_ipv4_cidr                 = (known after apply)
      + cluster_telemetry                 = (known after apply)
      + confidential_nodes                = (known after apply)
      + database_encryption               = (known after apply)
      + datapath_provider                 = (known after apply)
      + default_max_pods_per_node         = (known after apply)
      + default_snat_status               = (known after apply)
      + description                       = (known after apply)
      + dns_config                        = (known after apply)
      + enable_autopilot                  = (known after apply)
      + enable_binary_authorization       = (known after apply)
      + enable_intranode_visibility       = (known after apply)
      + enable_kubernetes_alpha           = (known after apply)
      + enable_l4_ilb_subsetting          = (known after apply)
      + enable_legacy_abac                = (known after apply)
      + enable_shielded_nodes             = (known after apply)
      + enable_tpu                        = (known after apply)
      + endpoint                          = (known after apply)
      + id                                = (known after apply)
      + identity_service_config           = (known after apply)
      + initial_node_count                = (known after apply)
      + ip_allocation_policy              = (known after apply)
      + label_fingerprint                 = (known after apply)
      + location                          = "asia-southeast2"
      + logging_config                    = (known after apply)
      + logging_service                   = (known after apply)
      + maintenance_policy                = (known after apply)
      + master_auth                       = (known after apply)
      + master_authorized_networks_config = (known after apply)
      + master_version                    = (known after apply)
      + min_master_version                = (known after apply)
      + monitoring_config                 = (known after apply)
      + monitoring_service                = (known after apply)
      + name                              = "gke-fb05db6d"
      + network                           = (known after apply)
      + network_policy                    = (known after apply)
      + networking_mode                   = (known after apply)
      + node_config                       = (known after apply)
      + node_locations                    = (known after apply)
      + node_pool                         = (known after apply)
      + node_version                      = (known after apply)
      + notification_config               = (known after apply)
      + operation                         = (known after apply)
      + pod_security_policy_config        = (known after apply)
      + private_cluster_config            = (known after apply)
      + private_ipv6_google_access        = (known after apply)
      + release_channel                   = (known after apply)
      + remove_default_node_pool          = (known after apply)
      + resource_labels                   = (known after apply)
      + resource_usage_export_config      = (known after apply)
      + self_link                         = (known after apply)
      + services_ipv4_cidr                = (known after apply)
      + subnetwork                        = (known after apply)
      + tpu_ipv4_cidr_block               = (known after apply)
      + vertical_pod_autoscaling          = (known after apply)
      + workload_identity_config          = (known after apply)
    }

  # module.gke.google_container_cluster.primary will be updated in-place
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-fb05db6d"
      ~ min_master_version          = "1.22" -> "1.21.6-gke.1500"
        name                        = "gke-fb05db6d"
        # (27 unchanged attributes hidden)



















        # (19 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.primary_node_pool will be updated in-place
  ~ resource "google_container_node_pool" "primary_node_pool" {
        id                          = "projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-fb05db6d/nodePools/primary"
        name                        = "primary"
      ~ version                     = "1.22.4-gke.1501" -> "1.21.6-gke.1500"
        # (9 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  # Warning: this attribute value will be marked as sensitive and will not
  # display in UI output after applying this change.
  ~ client_token = (sensitive value)

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 5 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @jai, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*